#include <iostream>
#include <string>
#include <windows.h>
#include <conio.h>
#include <math.h>
#include "lab1_1.h"
#include "lab1_2.h"
#include "lab2_2.h"
#include "lab2_4.h"
#include "lab3.h"
#include "lab4_1.h"
#include "lab4_2.h"
#include "lab5.h"
#include "lab6.h"
#include "lab7.h"

using namespace std;
int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	cout << "Виклик функції Лабораторної роботи №1, задача №1:" << endl << "Дано два числа.Знайти суму середнього геометричного їх кубів і середнього арифметичного їх квадратів. " << endl;
	lab1_1();
	cout << endl;
	cout << "Виклик функції Лабораторної роботи №1, задача №2: " << endl << "Довжина відрізка задана в дюймах (1 дюйм = 2,54 см). Перевести введене значення довжини в метричну систему" << endl;
	lab1_2();
	cout << endl;
	cout << "Виклик функції Лабораторної роботи №2, задача №2: " << endl << "Дано значення дійсної величини.Визначити 1 / (x^2 - 2x - 10)" << endl;
	lab2_2();
	cout << endl;
	cout << "Виклик функції Лабораторної роботи №2, задача №4: " << endl;
	lab2_4();
	cout << endl;
	cout << "Виклик функції Лабораторної роботи №3: " << endl << " Ввести значення 2-х цілих змінних а і b. Направити два покажчика на ці змінні. За допомогою покажчика збільшити значення змінної а в 2 рази якщо а > b інакше b зменшити в 2 рази." << endl;
	lab3();
	cout << endl;
	cout << "Виклик функції Лабораторної роботи №4, задача №1: " << endl << "Дано дійсні числа a1, a2, …, a30, b1, b2, …, b30. Обчислити (a1 + b30)(a2 + b29)…(a30 + b1)." << endl;
	lab4_1();
	cout << endl;
	cout << "Виклик функції Лабораторної роботи №4, задача №2: " << endl << "Нехай дано натуральне число n і дійсні числа а1, …, аn. У послідовності а1, …, аn всі від’ємні члени збільште на 0, 5, а всі невід’ємні, менші середнього арифметичного, замініть на 0, 1." << endl;
	lab4_2();
	cout << endl;
	cout << "Виклик функції Лабораторної роботи №5: " << endl << "У даному тексті всі послідовності крапок замінити на одну крапку" << endl;
	lab5();
	cout << "Виклик функції Лабораторної роботи №6: " << endl << "Описати структуру з ім'ям ZNAK, що містить наступні поля:записи повинні бути впорядковані по датах народження" << endl;
	cout << endl;
	lab6();
	cout << endl;
	cout << "Описати рекурсивну функцію Combin1 (N, K) цілого типу, яка знаходить C(N, K) - число поєднань з N елементів по K - за допомогою рекурентного співвідношення : C(N, 0) = C(N, N) = 1,C(N, K) = C(N – 1, K) + C(N – 1, K – 1) при 0 < K < N." << endl;
	lab7();
	cout << endl;
	return 0;
}